In [2]:
##reading different data sources with the help of pandas
from io import StringIO

In [5]:
import pandas as pd
df=pd.read_csv(r"C:\Users\lokes\Downloads\gail data.csv")
df.head()

        Date   Open   High    Low  Close    Volume
0   2022-6-9  95.50  97.95  95.20  95.55  10734990
1  2022-6-10  95.80  96.50  93.45  93.90   9311255
2  2022-6-13  93.15  93.15  90.25  92.05  12132084
3  2022-6-14  91.55  94.15  91.30  92.45   7573116
4  2022-6-15  94.25  95.75  91.85  92.85  16896789

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 490 entries, 0 to 489
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    490 non-null    object
 1   Open    490 non-null    float64
 2   High    490 non-null    float64
 3   Low     490 non-null    float64
 4   Close   490 non-null    float64
 5   Volume  490 non-null    int64
dtypes: float64(4), int64(1), object(1)
memory usage: 23.1+ KB

In [7]:
df.describe()

             Open        High         Low       Close        Volume
count  490.000000  490.000000  490.000000  490.000000  4.900000e+02
mean   117.734796  119.321429  115.925816  117.598571  1.657169e+07
std     37.403896   38.181098   36.482918   37.334655  1.158904e+07
min     79.100000   80.150000   77.500000   79.300000  8.691070e+05
25%     89.675000   90.800000   88.337500   89.525000  9.144671e+06
50%    102.825000  104.050000  102.025000  103.100000  1.310113e+07
75%    127.862500  131.062500  126.312500  129.512500  1.978615e+07
max    209.950000  213.650000  208.650000  209.550000  8.478419e+07

In [9]:
df.to_csv("test.csv")

In [25]:
data=("a,b,c,d\n"
      "1,2,3,4\n"
     "1,2,3,4\n"
     "1,2,3\n")

In [26]:
df=pd.read_csv(StringIO(data),dtype='object')

In [29]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

   a  b  c    d
0  1  2  3    4
1  1  2  3    4
2  1  2  3  NaN

In [37]:
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [32]:
df["a"]

0    1
1    1
2    1
Name: a, dtype: object

In [33]:
data=("a,b,c,d\n"
      "1,2,3,4\n"
     "1,2,3,4\n"
     "1,2,3\n")

In [36]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 200.0 bytes

In [39]:
data=("index,a,b,c,d\n"
      "1,2,orange,3,4\n"
     "1,2,3,4\n"
     "1,2,cow,3\n")

In [44]:
df=pd.read_csv(StringIO(data),index_col=0)

In [45]:
df

       a       b  c    d
index
1      2  orange  3  4.0
1      2       3  4  NaN
1      2     cow  3  NaN

In [46]:
#use index cols and usecols
data=("index,a,b,c,d\n"
      "1,2,orange,3,4\n"
     "1,2,3,4\n"
     "1,2,cow,3\n")

In [47]:
df=pd.read_csv(StringIO(data),usecols=['b','c'])

In [48]:
df

        b  c
0  orange  3
1       3  4
2     cow  3